espressif/arduino-esp32/libraries/BLE/src/BLEAdvertising.cpp
  // --- Manufacturer data ---
  if (m_advData.manufacturer_len > 0 && m_advData.p_manufacturer_data
      && remaining >= (uint16_t)(2 + m_advData.manufacturer_len)) {
    *p++ = m_advData.manufacturer_len + 1;
    *p++ = ESP_BLE_AD_MANUFACTURER_SPECIFIC_TYPE;
    memcpy(p, m_advData.p_manufacturer_data, m_advData.manufacturer_len);
    p += m_advData.manufacturer_len;
    remaining -= 2 + m_advData.manufacturer_len;
  }

  // --- Service data ---
  if (m_advData.service_data_len > 0 && m_advData.p_service_data
      && remaining >= (uint16_t)(2 + m_advData.service_data_len)) {
    *p++ = m_advData.service_data_len + 1;
    *p++ = ESP_BLE_AD_TYPE_SERVICE_DATA;
    memcpy(p, m_advData.p_service_data, m_advData.service_data_len);
    p += m_advData.service_data_len;
    remaining -= 2 + m_advData.service_data_len;
  }

  // --- Device name (truncated to fit, omitted when name goes in the scan response) ---
  if (includeName) {
    String deviceName = BLEDevice::getDeviceName();
    uint16_t nameLen = deviceName.length();
    if (nameLen > 0 && remaining >= 3) {
      uint16_t maxChars = remaining - 2;
      bool complete = (nameLen <= maxChars);
      uint16_t actualLen = complete ? nameLen : maxChars;
      *p++ = actualLen + 1;
      *p++ = complete ? ESP_BLE_AD_TYPE_NAME_CMPL : ESP_BLE_AD_TYPE_NAME_SHORT;
      memcpy(p, deviceName.c_str(), actualLen);
      p += actualLen;
      remaining -= 2 + actualLen;
    }
  }

  return (uint16_t)(p - buf);
}

void BLEAdvertising::setAdvertisementChannelMap(esp_ble_adv_channel_t channel_map) {
  m_advParams.channel_map = channel_map;
}  // setAdvertisementChannelMap

/**
 * @brief Start advertising.
 * Start advertising.
 * @return N/A.
 */
bool BLEAdvertising::start() {
  log_v(">> start: customAdvData: %d, customScanResponseData: %d, advDataSet: %d", m_customAdvData, m_customScanResponseData, m_advDataSet);

  // If async configuration is already in progress, don't re-enter.
  // The GAP event handler will start advertising when the config completes.
  if (m_advConfiguring) {
    log_w("Advertising configuration already in progress");
    return true;
  }

  // If advertising data needs to be (re)configured, kick off the async configuration.
  // Bluedroid's esp_ble_gap_config_adv_data() is asynchronous and fires a GAP completion
  // event when done. We must NOT block here with semaphores because start() can be called
  // from BT callbacks (e.g., the disconnect handler), and both GATT and GAP callbacks are
  // dispatched on the same BTC task - blocking would deadlock.
  // Instead, we use the same non-blocking approach as NimBLE: kick off the config and let
  // the GAP event handler (handleGAPEvent) chain the remaining steps.
  if (!m_advDataSet) {
    freeServiceUUIDs();

    if (!m_customAdvData) {
      // Always use the raw advertising API to encode service UUIDs in their
      // native compact sizes (16/32/128-bit).
      //
      // Match NimBLE behaviour for name placement: try to fit the device name
      // in the advertising packet first; only move it to the scan response when
      // the advertising payload is already full (consistent with NimBLE's
      // name-overflow check at lines 1609-1633 of the NimBLE start() path).
      uint8_t rawBuf[ESP_BLE_ADV_DATA_LEN_MAX];

      // First pass: build the adv packet without the name to measure remaining space.
      uint16_t baseLen = buildRawAdvData(rawBuf, sizeof(rawBuf), false);
      String deviceName = BLEDevice::getDeviceName();
      // +2 accounts for the 2-byte AD field header (length byte + type byte).
      uint16_t nameBytes = (deviceName.length() > 0) ? (uint16_t)(deviceName.length() + 2) : 0;
      bool nameFitsInAdv = (nameBytes == 0) || (nameBytes <= (ESP_BLE_ADV_DATA_LEN_MAX - baseLen));

      uint16_t rawLen;
      if (nameFitsInAdv || !m_scanResp) {
        // Name fits in the adv packet, or there is no scan response fallback.
        // buildRawAdvData will truncate the name if it does not fully fit and
        // scan response is disabled (matching NimBLE's truncation path).
        rawLen = buildRawAdvData(rawBuf, sizeof(rawBuf), true);
        m_nameInScanResp = false;
      } else {
        // Name overflows the adv packet and scan response is available:
        // keep the adv packet without the name, let configureScanResponseData()
        // include it in the scan response (matching NimBLE's overflow path).
        rawLen = baseLen;
        m_nameInScanResp = true;
      }

      esp_err_t errRc = ::esp_ble_gap_config_adv_data_raw(rawBuf, rawLen);
      if (errRc != ESP_OK) {
        log_e("esp_ble_gap_config_adv_data_raw: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
        return false;
      }
      m_advConfiguring = true;
      return true;
    }

    if (!m_customScanResponseData && m_scanResp) {
      // Custom adv data but auto scan response - configure scan response asynchronously.
      // Since the adv data is user-supplied we do not know whether it contains
      // the name; always include the name in the scan response to be safe.
      m_nameInScanResp = true;
      // The GAP event handler will start advertising when config completes.
      if (!configureScanResponseData()) {
        freeServiceUUIDs();
        return false;
      }
      m_advConfiguring = true;
      log_d("Scan response data configuration started (async)");
      return true;
    }

    // Both adv data and scan response are custom (or no scan response needed).
    // No async operations, mark as configured and proceed to start.
    m_advDataSet = true;
    freeServiceUUIDs();
  }

  // Advertising data is already configured, just start advertising.
  esp_err_t errRc = ::esp_ble_gap_start_advertising(&m_advParams);
  if (errRc != ESP_OK) {
    log_e("<< esp_ble_gap_start_advertising: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
  } else {
    log_v("<< start");
  }
  return ESP_OK == errRc;
}  // start

/**
 * @brief Stop advertising.
 * Stop advertising.
 * @return N/A.
 */
bool BLEAdvertising::stop() {
  log_v(">> stop");
  esp_err_t errRc = ::esp_ble_gap_stop_advertising();
  if (errRc != ESP_OK) {
    log_e("esp_ble_gap_stop_advertising: rc=%d %s", errRc, GeneralUtils::errorToString(errRc));
  } else {
    log_v("<< stop");
  }
  return ESP_OK == errRc;
}  // stop

void BLEAdvertising::handleGAPEvent(esp_gap_ble_cb_event_t event, esp_ble_gap_cb_param_t *param) {
  log_d("handleGAPEvent [event no: %d]", (int)event);

